###################################################################

# Created by write_sdc on Sat Jun 19 17:47:32 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_capacitance 2 [current_design]
set_max_fanout 20 [current_design]
set_max_transition 0.2 [current_design]
set_load -pin_load 1 [get_ports clk]
set_load -pin_load 1 [get_ports reset]
set_load -pin_load 1 [get_ports halt]
set_load -pin_load 1 [get_ports rd]
set_load -pin_load 1 [get_ports wr]
set_load -pin_load 1 [get_ports {addr[12]}]
set_load -pin_load 1 [get_ports {addr[11]}]
set_load -pin_load 1 [get_ports {addr[10]}]
set_load -pin_load 1 [get_ports {addr[9]}]
set_load -pin_load 1 [get_ports {addr[8]}]
set_load -pin_load 1 [get_ports {addr[7]}]
set_load -pin_load 1 [get_ports {addr[6]}]
set_load -pin_load 1 [get_ports {addr[5]}]
set_load -pin_load 1 [get_ports {addr[4]}]
set_load -pin_load 1 [get_ports {addr[3]}]
set_load -pin_load 1 [get_ports {addr[2]}]
set_load -pin_load 1 [get_ports {addr[1]}]
set_load -pin_load 1 [get_ports {addr[0]}]
set_load -pin_load 1 [get_ports {data[7]}]
set_load -pin_load 1 [get_ports {data[6]}]
set_load -pin_load 1 [get_ports {data[5]}]
set_load -pin_load 1 [get_ports {data[4]}]
set_load -pin_load 1 [get_ports {data[3]}]
set_load -pin_load 1 [get_ports {data[2]}]
set_load -pin_load 1 [get_ports {data[1]}]
set_load -pin_load 1 [get_ports {data[0]}]
set_load -min -pin_load 0.5 [get_ports clk]
set_load -min -pin_load 0.5 [get_ports reset]
set_load -min -pin_load 0.5 [get_ports halt]
set_load -min -pin_load 0.5 [get_ports rd]
set_load -min -pin_load 0.5 [get_ports wr]
set_load -min -pin_load 0.5 [get_ports {addr[12]}]
set_load -min -pin_load 0.5 [get_ports {addr[11]}]
set_load -min -pin_load 0.5 [get_ports {addr[10]}]
set_load -min -pin_load 0.5 [get_ports {addr[9]}]
set_load -min -pin_load 0.5 [get_ports {addr[8]}]
set_load -min -pin_load 0.5 [get_ports {addr[7]}]
set_load -min -pin_load 0.5 [get_ports {addr[6]}]
set_load -min -pin_load 0.5 [get_ports {addr[5]}]
set_load -min -pin_load 0.5 [get_ports {addr[4]}]
set_load -min -pin_load 0.5 [get_ports {addr[3]}]
set_load -min -pin_load 0.5 [get_ports {addr[2]}]
set_load -min -pin_load 0.5 [get_ports {addr[1]}]
set_load -min -pin_load 0.5 [get_ports {addr[0]}]
set_load -min -pin_load 0.5 [get_ports {data[7]}]
set_load -min -pin_load 0.5 [get_ports {data[6]}]
set_load -min -pin_load 0.5 [get_ports {data[5]}]
set_load -min -pin_load 0.5 [get_ports {data[4]}]
set_load -min -pin_load 0.5 [get_ports {data[3]}]
set_load -min -pin_load 0.5 [get_ports {data[2]}]
set_load -min -pin_load 0.5 [get_ports {data[1]}]
set_load -min -pin_load 0.5 [get_ports {data[0]}]
create_clock [get_ports clk]  -period 5  -waveform {0 2.5}
set_clock_uncertainty -setup 0.25  [get_clocks clk]
set_clock_uncertainty -hold 0.15  [get_clocks clk]
set_input_delay -clock clk  1.5  [get_ports reset]
set_input_delay -clock clk  1.5  [get_ports {data[7]}]
set_input_delay -clock clk  1.5  [get_ports {data[6]}]
set_input_delay -clock clk  1.5  [get_ports {data[5]}]
set_input_delay -clock clk  1.5  [get_ports {data[4]}]
set_input_delay -clock clk  1.5  [get_ports {data[3]}]
set_input_delay -clock clk  1.5  [get_ports {data[2]}]
set_input_delay -clock clk  1.5  [get_ports {data[1]}]
set_input_delay -clock clk  1.5  [get_ports {data[0]}]
set_output_delay -clock clk  0.75  [get_ports {data[7]}]
set_output_delay -clock clk  0.75  [get_ports {data[6]}]
set_output_delay -clock clk  0.75  [get_ports {data[5]}]
set_output_delay -clock clk  0.75  [get_ports {data[4]}]
set_output_delay -clock clk  0.75  [get_ports {data[3]}]
set_output_delay -clock clk  0.75  [get_ports {data[2]}]
set_output_delay -clock clk  0.75  [get_ports {data[1]}]
set_output_delay -clock clk  0.75  [get_ports {data[0]}]
set_output_delay -clock clk  0.75  [get_ports halt]
set_output_delay -clock clk  0.75  [get_ports rd]
set_output_delay -clock clk  0.75  [get_ports wr]
set_output_delay -clock clk  0.75  [get_ports {addr[12]}]
set_output_delay -clock clk  0.75  [get_ports {addr[11]}]
set_output_delay -clock clk  0.75  [get_ports {addr[10]}]
set_output_delay -clock clk  0.75  [get_ports {addr[9]}]
set_output_delay -clock clk  0.75  [get_ports {addr[8]}]
set_output_delay -clock clk  0.75  [get_ports {addr[7]}]
set_output_delay -clock clk  0.75  [get_ports {addr[6]}]
set_output_delay -clock clk  0.75  [get_ports {addr[5]}]
set_output_delay -clock clk  0.75  [get_ports {addr[4]}]
set_output_delay -clock clk  0.75  [get_ports {addr[3]}]
set_output_delay -clock clk  0.75  [get_ports {addr[2]}]
set_output_delay -clock clk  0.75  [get_ports {addr[1]}]
set_output_delay -clock clk  0.75  [get_ports {addr[0]}]
